EDT/МПСтриж/src/Documents/ПодтверждениеДС/ПодтверждениеДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодтверждениеДС</name>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПереданВЦБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаВЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласенСДаннымиМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДС</name>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.Заказ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Enums/ТипЗаказа/ТипЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗаказа</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Documents/ДанныеЗаказаВодителя/ДанныеЗаказаВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаВодителя</name>
  <posting>Deny</posting>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказаВодитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовЗапросаСостоянияЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЧекаНаПечать</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиЧеков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратныйЧек</name>
    <type>
      <types>DocumentRef.ЧекКПечатиВозвратПрихода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодъемногоБрейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаРассчитанная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаПодтвержденная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХодокНаЭтаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестоваяСреда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтоимостьДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченаСтоимостьДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаЧерезAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БылаПроизведенаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Catalogs/РезультатыДоставки/РезультатыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РезультатыДоставки</name>
  <predefined>
    <items>
      <name>Доставлен</name>
      <description>Доставлен</description>
    </items>
    <items>
      <name>КДоставке</name>
      <description>К доставке</description>
    </items>
  </predefined>
  <attributes>
    <name>Перенос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/Documents/ПодтверждениеДС/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьДокументНаСервере()
	Зап = Новый Запрос;
	
	//частичка
	//Зап.Текст = "ВЫБРАТЬ
	//            |	МАКСИМУМ(ДанныеЗаказаВодителя.Дата) КАК Дата,
	//            |	ДанныеЗаказаВодителя.Реализация КАК Реализация,
	//            |	МАКСИМУМ(ДанныеЗаказаВодителя.Ссылка) КАК Ссылка
	//            |ПОМЕСТИТЬ ВТ_Данные
	//            |ИЗ
	//            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	//            |ГДЕ
	//            |	ДанныеЗаказаВодителя.Реализация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//            |
	//            |СГРУППИРОВАТЬ ПО
	//            |	ДанныеЗаказаВодителя.Реализация
	//            |;
	//            |
	//            |////////////////////////////////////////////////////////////////////////////////
	//            |ВЫБРАТЬ
	//            |	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено * ДанныеЗаказаВодителяДоставленныеТовары.Цена) КАК Сумма,
	//            |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.ТипОплаты КАК ТипОплаты,
	//            |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация КАК Заказ
	//            |ИЗ
	//            |	ВТ_Данные КАК ВТ_Данные
	//            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
	//            |		ПО ВТ_Данные.Ссылка.Ссылка = ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка
	//            |
	//            |СГРУППИРОВАТЬ ПО
	//            |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.ТипОплаты,
	//            |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация";
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Реализация КАК Реализация,
	            |	ДанныеЗаказаВодителя.Ссылка КАК Ссылка
	            |ПОМЕСТИТЬ ВТ_Данные
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            |			ДанныеЗаказаВодителя.Реализация КАК Реализация,
	            |			МАКСИМУМ(ДанныеЗаказаВодителя.Дата) КАК Дата
	            |		ИЗ
	            |			Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |		
	            |		СГРУППИРОВАТЬ ПО
	            |			ДанныеЗаказаВодителя.Реализация) КАК ВложенныйЗапрос
	            |		ПО ДанныеЗаказаВодителя.Реализация.Ссылка = ВложенныйЗапрос.Реализация.Ссылка
	            |			И ДанныеЗаказаВодителя.Дата = ВложенныйЗапрос.Дата
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Реализация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	            |	И ДанныеЗаказаВодителя.Реализация.ТипЗаказа.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипЗаказа.Доставка)
	            |	И ДанныеЗаказаВодителя.Дата >= &ДатаНачСмены
	            |	И ДанныеЗаказаВодителя.Реализация.СнятьСДоставки = ЛОЖЬ
	            |	И ДанныеЗаказаВодителя.ВозвратныйЧек = ЗНАЧЕНИЕ(документ.чеккпечатиВозвратПрихода.пустаяссылка)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СУММА(ВТ_Данные.Ссылка.СуммаНал) КАК Сумма,
	            |	ЕСТЬNULL(ВТ_Данные.Ссылка.ТипОплаты, ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)) КАК ТипОплаты,
	            |	ВТ_Данные.Реализация КАК Заказ
	            |ИЗ
	            |	ВТ_Данные КАК ВТ_Данные
	            |ГДЕ
	            |	ВТ_Данные.Ссылка.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.Доставлен)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВТ_Данные.Реализация,
	            |	ВТ_Данные.Ссылка.ТипОплаты";
	
	
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаРейса));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаРейса));
	Зап.УстановитьПараметр("ДатаНачСмены", НачалоДня(Объект.ДатаРейса) + 25200);
	
	Рез = Зап.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Нов = Объект.ДС.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Рез);
		Если Не ЗначениеЗаполнено(Нов.ТипОплаты) Тогда
			Нов.ТипОплаты = Справочники.ТипыОплат.Наличные;
		КонецеСли;	
	КонецЦикла;	
	Объект.Дата = ТекущаяДата();
	Если Объект.ДС.Количество() <> 0 Тогда
		СтрукЗаписи = Новый Структура;
		СтрукЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(СтрукЗаписи);
		СписокТиповОплат.Параметры.УстановитьЗначениеПараметра("Док", Объект.Ссылка);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	Если Объект.ДС.Количество() <> 0 Тогда
		Объект.ДС.Очистить();
	КонецеСли;	
	ЗаполнитьДокументНаСервере();
	Элементы.СписокТиповОплат.Обновить();
	Элементы.ФормаСогласен.Доступность = Истина;
	Элементы.ФормаНеСогласен.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокТиповОплат.Параметры.УстановитьЗначениеПараметра("Док", Объект.Ссылка);
	ТолькоПросмотр = Объект.ДокументПереданВЦБ;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаРейса = ОбщегоНазначения.ПолучитьПредполагаемуюДатуРейса();
		ЗаполнитьДокументНаСервере();
		Элементы.ФормаСогласен.Доступность = Истина;
		Элементы.ФормаНеСогласен.Доступность = Истина;
	КонецеСли;	
КонецПроцедуры

&НаСервере
Функция СогласенНаСервере()
	Объект.СогласенСДаннымиМП = Истина;
	РезультатЗаписи = ЗаписатьВыгрузитьПровестиДокумент();
	Возврат РезультатЗаписи;
КонецФункции

&НаСервере
Функция ПроверитьВозможностьЗаписиИВыгрузкиДокумента()
	Возврат УдаленноеЗакрытиеЭкипажейСервер.ПроверитьСтатусыНаНевыгруженностьВЦБ(Объект.ДатаРейса);	
КонецФункции	

&НаСервере
Функция ПроверитьВозможностьЗаписиИВыгрузкиДокументаНаУсловиеAssist()
	Возврат УдаленноеЗакрытиеЭкипажейСервер.ПроверитьНаличиеНевыгруженныхТранзакцийAssist(Объект.ДатаРейса);	
КонецФункции

&НаКлиенте
Процедура Согласен(Команда)
	Если Не ПроверитьВозможностьЗаписиИВыгрузкиДокумента() Тогда
		Сообщить("Обнаружены невыгруженные статусы в ЦБ! Выполните обмен перед тем, как делать удаленное закрытие!");
		Возврат;		
	КонецеСли;
	
	Если Не ПроверитьВозможностьЗаписиИВыгрузкиДокументаНаУсловиеAssist() Тогда
		Сообщить("Обнаружены невыгруженные в ЦБ данные Assist! Выполните обмен перед тем, как делать удаленное закрытие!");
		Возврат;		
	КонецеСли;
	
	Результат = СогласенНаСервере();
	Если Не Результат.Успешно Тогда
		Сообщить("Ошибка выгрузки документа в ЦБ! Описание проблемы: " + Результат.Описание);
		Возврат;
	Иначе
		Закрыть();
	КонецеСли;	
КонецПроцедуры

Функция ЗаписатьВыгрузитьПровестиДокумент()
	СтрукЗаписи = Новый Структура;
	СтрукЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(СтрукЗаписи);
	
	
	Результат = МодульОбмен.ВыгрузитьПодтверждениеНаличияДС(Объект.Ссылка);
	Если Результат.Успешно Тогда
		Объект.ДокументПереданВЦБ = Истина;
		Объект.НомерДокументаВЦБ = Результат.НомерДокументаВЦБ;
		СтрукЗаписи = Новый Структура;
		СтрукЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		Записать(СтрукЗаписи);
	КонецЕсли;
	ТолькоПросмотр = Результат.Успешно;
	Возврат Результат;
КонецФункции

&НаСервере
Функция НеСогласенНаСервере()
	Объект.СогласенСДаннымиМП = Ложь;
	РезультатЗаписи = ЗаписатьВыгрузитьПровестиДокумент();
	Возврат РезультатЗаписи;
КонецФункции

&НаКлиенте
Процедура НеСогласен(Команда)
	Если Не ПроверитьВозможностьЗаписиИВыгрузкиДокумента() Тогда
		Сообщить("Обнаружены невыгруженные статусы в ЦБ! Выполните обмен перед тем, как делать удаленное закрытие!");
		Возврат;		
	КонецеСли;
		
	
	Результат = НеСогласенНаСервере();
	Если Не Результат.Успешно Тогда
		Сообщить("Ошибка выгрузки документа в ЦБ! Описание проблемы: " + Результат.Описание);
		Возврат;
	Иначе
		Закрыть();
	КонецеСли;	
	Сообщить("Необходимо вернуться на базу для закрытия рейса!", СтатусСообщения.ОченьВажное);
КонецПроцедуры
